app/controllers/home_controller.rb

  def r2
    @notes = Note.all
---
SELECT "notes".* FROM "notes"

  def r3
     @notes = Note.all
---
SELECT "notes".* FROM "notes"