app/controllers/notes_controller.rb

  def create
   @note = Note.new
   @note.title = params[:title]
   @note.content = params[:content]
   @note.category = params[:category]
   @note.save
---
INSERT INTO "notes" ("title", "content", "category", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "eeeew"], ["content", "eeeeeeeeee\r\nee"], ["category", "3"], ["created_at", "2016-08-20 06:37:53.566648"], ["updated_at", "2016-08-20 06:37:53.566648"]]

  def update
    @note = Note.find(params[:id])
    @note.title = params[:title]
    @note.content = params[:content]
    @note.category = params[:category]
    @note.save
---
SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "notes" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "notes"."id" = ?  [["title", "2016730-update"], ["content", "ok?"], ["updated_at", "2016-07-30 06:09:37.411081"], ["id", 1]]